{
    "pages": [
        {
            "tags": "",
            "text": "We will update this page to include links to each day activity and extra material for the students. World Final Class Brazilian Final Class",
            "title": "Day-by-day",
            "url": "/MaratonaVerao2019/daybyday.html"
        },
        {
            "tags": "",
            "text": "",
            "title": "Search",
            "url": "/MaratonaVerao2019/search.html"
        },
        {
            "tags": "",
            "text": "Every day we will have lectures and contests. Each class will have its specific schedule. The base schedule is shown bellow: Activity World Final Class Brazilian Final Class Contest 13:15-18:15 08:00-13:00 Lecture 08:30-11:30 14:30-18:00 Lunch 11:30-13:00 13:00-14:00 Dinner 18:15-19:00 18:00-19:00 World Final Class Schedule Lectures will start at 8:30 and go up to 11:30, when students will go to lunch. The afternoon contest will start at 13:15 and go up to 18:15, when students will go to dinner. Brazilian Final Class Schedule Contest will start at 8:00 and go up to 13:00, when students will go to lunch. The afternoon lecture will start at 14:30 and go up to 18:00, when students will go to dinner.",
            "title": "Schedule",
            "url": "/MaratonaVerao2019/schedule.html"
        },
        {
            "tags": "",
            "text": "This is the 2019 edition of our School at Unicamp. Previously we held two editions at USP. You can refer to the previous editions home pages at: 2018 Edition - Activities 2017 Edition - Activities 2016 Edition - Activities 2015 Edition - Activities 2014 Edition - Activities 2013 Edition - Activities 2012 Edition - Activities",
            "title": "Past Editions",
            "url": "/MaratonaVerao2019/past.html"
        },
        {
            "tags": "",
            "text": "The Brazilian ICPC Summer School 2019 is organized by the Brazilian Computing Society and hosted by Unicamp during two weeks from January 21st to February 2nd . Our main goal is to train ICPC World Finalists and Future Brazilian Finalists. This year we will split the group into two levels, the W orld Final level and the B razilian Final Level. If you are unable to attend, you still will be able to watch the lectures online and take part of the contests remotely. All interested students should register individually through our online system. If you have a team, all three members should register individually. The registration fee will cover food expenses. World Finalists and Brazilian Medalists are exempt from the registration fee. This edition will have lectures from Monday to Saturday. Each thursday will be dedicated to our sponsors. The full schedule will be released soon. Don't forget to follow our Facebook page for photos and events announcements. You can also follow our lectures through our YouTube Channel .",
            "title": "Brazilian ICPC Summer School",
            "url": "/MaratonaVerao2019/index.html"
        },
        {
            "tags": "",
            "text": "This year, we are asking for individual registration and payments. World Finalists and Brazilian Medalists are will not pay the registration fee. Brazilian Computer Society Members will get 20% discount on registration. You can get some discount if you opt to register to SBC during the school registration process (there is no auto-renewal requirement). Registration process This year we will have two distinct classes and you should opt for them during the registration process. World Final Class This class will have up to 90 students and we will invite one international experienced instructor per week to teach and create the contests. Registration to this class will be prioritized by the following criteria You are a 2019 World Finalist You are a Brazilian Medalist (top 10 in the 2018 Brazilian Final) You are registered for the 2019 IOI You are invited by OBI Your team solved, at least, 7 problems in the 2018 Brazilian Final and is still able to compete next year If you think you have a previous acomplishment compatible to any of this list, you can register to the World Final Class and explain you acomplishment. We will evaluate it based on the availability of slots. Brazilian Final Class This class will have up to 90 students and we will focus on the next year Brazilian Finals. You should be able to compete next year. Registration cost Category Registration Transportation Housing Lunch Dinner Brazilian World Finalist free included stippend included included Brazilian Medalist free no no included included Brazilian Regional Champion free no no included included World Finalist free no no included included Others early R$300.00 / late R$350.00 no no included included We are still finishing our budget. We will define the stipend in January. If you are a World Finalist or Brazilian Medalists, you must finish your registration on the system without payment. After that, send an email to rodolfo@ic.unicamp.br. Do not pay! I will mark your registration as complete without the payment. For the Brazilian World Finalists, we are going to provide transportation. Do not buy any kind of transportation by yourself. We will not reimburse you in such case. Pre-registration required All participants must pre-register in our online form . Only pre-registered participants will be able to register into SBC web site.",
            "title": "Registration",
            "url": "/MaratonaVerao2019/registration.html"
        },
        {
            "tags": "",
            "text": "World Final Class We are inviting internationally experienced instructors and will fill the information here as soon as we get them. We will have one instructor per week. Brazilian Final Class We are inviting experienced Brazilian former competitors/coaches/trainers to create this class. We may have one distinct instructor per day.",
            "title": "Instructors",
            "url": "/MaratonaVerao2019/instructors.html"
        },
        {
            "tags": "",
            "text": "Our laboratories and classrooms are located in the Institute of Computing, building IC-3. All meals will be served at the University Restaurant. How to arrive in Campinas? Our nearest airport is Viracopos (VCP), served by the following airlines: Azul, TAM, Gol, e Avianca. There is a direct bus line from the airport to downtown and central bus station managed by LiraBus (previously Caprioli), or you can take the city bus line 193 to the central bus terminal and bus 330 to Unicamp. A taxi from the airport to Unicamp will cost around R$120,00. We also have Uber in Campinas. If you prefer flying to São Paulo, you can take a bus from LiraBus (previously Caprioli) to Campinas bus station, and take the 330 bus to Unicamp. If you arrive by bus, you can take the bus 330 to Unicamp. You can also visit Unicamp web page for more local information: Acesso à Unicamp . We have Uber operating here in Campinas. Use the promotional code ncjcb to get discounts. If you are traveling in groups, get one registered using this promotional code than use the first user´s promotional code to invite the others . Housing We recommend that you visit Morar Unicamp to select a place to stay and directly contact them. We do not cover housing expenses. We will provide local student contacts to the registered students so you can arrange cheaper places to stay. If you want to stay in a hotel, you should look at Matiz or CPV - Casa do Professor Visitante (inside the campus, 150m from Institute of Computing). Organizing Committee The organizing committee is composed by Rodolfo Azevedo (UNICAMP), Rafael C. S. Schouery (UNICAMP), Ricardo Anido (UNICAMP) e Carlos Ferreira (USP).",
            "title": "Local Information",
            "url": "/MaratonaVerao2019/local.html"
        }
    ]
}